================================================================================
Basic HTML element
================================================================================

<div>content</div>

--------------------------------------------------------------------------------

(document
  (text)
  (element
    (start_tag
      (tag_name))
    (text)
    (end_tag
      (tag_name)))
  (text))

================================================================================
Simple Alpine directive
================================================================================

<div x-data="count">test</div>

--------------------------------------------------------------------------------

(document
  (text)
  (element
    (start_tag
      (tag_name)
      (attribute
        (alpine_attribute
          (alpine_directive)
          (alpine_attribute_value
            (alpine_expression
              (identifier))))))
    (text)
    (end_tag
      (tag_name)))
  (text))

================================================================================
Alpine object literal
================================================================================

<div x-data="{ count: 0 }">content</div>

--------------------------------------------------------------------------------

(document
  (text)
  (element
    (start_tag
      (tag_name)
      (attribute
        (alpine_attribute
          (alpine_directive)
          (alpine_attribute_value
            (alpine_expression
              (object_literal
                (object_property
                  (identifier)
                  (number))))))))
    (text)
    (end_tag
      (tag_name)))
  (text))

================================================================================
Alpine shorthand directives
================================================================================

<button @click="count++" :class="active">Click</button>

--------------------------------------------------------------------------------

(document
  (text)
  (element
    (start_tag
      (tag_name)
      (attribute
        (alpine_attribute
          (alpine_shorthand)
          (alpine_attribute_value
            (alpine_expression
              (postfix_expression
                (identifier))))))
      (attribute
        (alpine_attribute
          (alpine_shorthand)
          (alpine_attribute_value
            (alpine_expression
              (identifier))))))
    (text)
    (end_tag
      (tag_name)))
  (text))

================================================================================
Self-closing tag with Alpine
================================================================================

<input x-model="name" />

--------------------------------------------------------------------------------

(document
  (text)
  (element
    (self_closing_tag
      (tag_name)
      (attribute
        (alpine_attribute
          (alpine_directive)
          (alpine_attribute_value
            (alpine_expression
              (identifier)))))))
  (text))