================================================================================
Basic HTML element
================================================================================

<div>content</div>

--------------------------------------------------------------------------------

(document
  (element
    (start_tag
      (tag_name))
    (text)
    (end_tag
      (tag_name))))

================================================================================
Simple Alpine directive
================================================================================

<div x-data="count">test</div>

--------------------------------------------------------------------------------

(document
  (element
    (start_tag
      (tag_name)
      (alpine_attribute
        (alpine_directive (x_data))
        (quoted_attribute_value (attribute_value))))
    (text)
    (end_tag (tag_name))))

================================================================================
Alpine object literal
================================================================================

<div x-data="{ count: 0 }">content</div>

--------------------------------------------------------------------------------

(document
  (element
    (start_tag
      (tag_name)
      (alpine_attribute
        (alpine_directive (x_data))
        (quoted_attribute_value (attribute_value))))
    (text)
    (end_tag (tag_name))))

================================================================================
Alpine shorthand directives
================================================================================

<button @click="count++" :class="active">Click</button>

--------------------------------------------------------------------------------

(document
  (element
    (start_tag
      (tag_name)
      (alpine_attribute
        (alpine_shorthand (event_name))
        (quoted_attribute_value (attribute_value)))
      (alpine_attribute
        (alpine_shorthand (attribute_name))
        (quoted_attribute_value (attribute_value))))
    (text)
    (end_tag (tag_name))))

================================================================================
Self-closing tag with Alpine
================================================================================

<input x-model="name" />

--------------------------------------------------------------------------------

(document
  (element
    (self_closing_tag
      (tag_name)
      (alpine_attribute
        (alpine_directive (x_model))
        (quoted_attribute_value (attribute_value))))))